"[{\"title\": \"ARCH 6390 - Energy and Systems Simulation\", \"description\": \"Energy and Systems Simulation provides students with an introduction to advanced simulation tools and procedures necessary for analyzing the performance of complex environmental building systems. The course utilizes parametric software for the simulation and analysis of multi-objective optimization workflow procedures. Areas of building performance assessment include thermal and daylight optimization.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6400 - Criticism I\", \"description\": \"Criticism I introduces students to both historical and contemporary forms of discourse as it relates to the disciplines of architecture, landscape architecture, and urbanism. The course serves as an introduction to critical thinking and writing and provides students with the necessary analytical, verbal, and written skill sets to effectively participate in the discursive aspects of the disciplines of architecture, landscape architecture, and urbanism.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6510 - Disciplinary Research Methods Seminar\", \"description\": \"A seminar in research methods. This course will review the major considerations and tasks involved in conducting research in areas appropriate to the architectural sciences. It introduces the essential aspects of designing, supporting, and conducting a research project. Major areas that will be considered include: history and present status of the quantitative and qualitative methods, strengths and weaknesses of each method and approach, location of resources, information and data, sampling or selection of research materials and/or participants, data collection, measurement, data analysis, and research writing and style.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARCH 6520 - Interdisciplinary Ph.D. Seminar\", \"description\": \"This is a seminar course restricted to students in their second year of doctoral study. It provides a critical forum for the discussion of issues from methods to sources confronting the students on the dissertation. This course will form the core of the interdisciplinary experience of the Doctor of Philosophy in Architectural Sciences. It supports the position that advanced work in architecture frequently builds on knowledge from several disciplines, and as such provides a model for encouraging cross disciplinary work in the Institute. It will involve a combination of senior faculty and visitors and regular presentation of dissertation work in progress.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}]"