"[{\"title\": \"ARCH 6390 - Energy and Systems Simulation\", \"description\": \"Energy and Systems Simulation provides students with an introduction to advanced simulation tools and procedures necessary for analyzing the performance of complex environmental building systems. The course utilizes parametric software for the simulation and analysis of multi-objective optimization workflow procedures. Areas of building performance assessment include thermal and daylight optimization.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 1200 - Beginners Architecture Career Discovery Program\", \"description\": \"Two-week introduction to architecture for rising high school juniors and seniors includes morning programs and introductory lectures in history and theory of architecture, computing and simulation, freehand and extreme drawing, building ecologies, building conservation, and construction systems. There will be field trips and career counseling. Afternoons will have individually critiqueed (tutored) design studios, group and individual projects, reviews, and public presentation. Acts as an opportunity for career discovery to decide whether a design education in architecture is appropriate. Summer term annually. Dates TBA. 9:00 - 4:00 pm.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Summer term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"\"}, {\"title\": \"ARCH 1210 - Advanced Architecture Career Discovery Program\", \"description\": \"Similar structure as the Beginners program. The Advanced program will continue to cultivate design foundations explored in the Beginners course. Dates: TBA. 9:00 - 4:00 pm.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 1200.\", \"offered\": \"When Offered: Summer term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"\"}, {\"title\": \"ARCH 6400 - Criticism I\", \"description\": \"Criticism I introduces students to both historical and contemporary forms of discourse as it relates to the disciplines of architecture, landscape architecture, and urbanism. The course serves as an introduction to critical thinking and writing and provides students with the necessary analytical, verbal, and written skill sets to effectively participate in the discursive aspects of the disciplines of architecture, landscape architecture, and urbanism.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 2150 - The Ethos of Architecture\", \"description\": \"This course will examine the spectrum of architectural phenomena and ideas without a specific chronology using examples ranging from antiquity to the contemporary world in western and non-western civilizations and produced in both vernacular and disciplinary cultures. An essential part of this course is to stimulate students\\u2019 curiosity about architecture and the larger world and introduce them to key issues of architecture regarding space, form, critique, technology, aesthetics, societal and cultural contexts, etc. Particular emphasis will be given to the emergence of modernism in architecture. Crucial to the goals of this course is to encourage students to pursue and develop their own unique vision and voice in architecture throughout their education and practice. Fundamental to this process is making students aware of the necessity to challenge their own subjectivities, biases, and presuppositions.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6510 - Disciplinary Research Methods Seminar\", \"description\": \"A seminar in research methods. This course will review the major considerations and tasks involved in conducting research in areas appropriate to the architectural sciences. It introduces the essential aspects of designing, supporting, and conducting a research project. Major areas that will be considered include: history and present status of the quantitative and qualitative methods, strengths and weaknesses of each method and approach, location of resources, information and data, sampling or selection of research materials and/or participants, data collection, measurement, data analysis, and research writing and style.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARCH 2160 - Architectural Media\", \"description\": \"This course continues the inquiry begun in ARCH 2150 The Ethos of Architecture and focuses especially on the implications that various media and means of representation have on the breadth of concerns within the history, theory, and critical practices of architecture and especially the generation of architecture.\", \"prerequisites\": \"Prerequisites/Corequisites: ARCH 4090 Architectural Case Studies.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6520 - Interdisciplinary Ph.D. Seminar\", \"description\": \"This is a seminar course restricted to students in their second year of doctoral study. It provides a critical forum for the discussion of issues from methods to sources confronting the students on the dissertation. This course will form the core of the interdisciplinary experience of the Doctor of Philosophy in Architectural Sciences. It supports the position that advanced work in architecture frequently builds on knowledge from several disciplines, and as such provides a model for encouraging cross disciplinary work in the Institute. It will involve a combination of senior faculty and visitors and regular presentation of dissertation work in progress.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARCH 6610 - Graduate Architecture Design 3\", \"description\": \"This is a design-based studio that focuses on the integration of structural, technical, detail, zoning, and code-related issues with respect to the design of a moderate to large-scale building of civic importance. Such building types are (but not limited to) libraries, theaters, city halls, judicial buildings, educational buildings, etc. An important focus of the design project will be the relationship of the building to its urban context. An essential part of the design will involve programming of the building as well as responding to numerous learning outcomes defined by the NAAB (the accrediting agency for professional architecture programs) for a comprehensive design project. This course is required of all architecture students in the M.Arch. program.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 5210 Graduate Architecture Design 2.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARCH 4820 Integrated Design Schematic studio.\", \"credit_hours\": \"Credit Hours: 5\"}, {\"title\": \"ARCH 6620 - Graduate Architecture Design 4\", \"description\": \"This is a technology-based design studio emphasizing the materialization and making of architectural design projects. The integration of building code requirements for fire protection, life safety, accessibility, building environmental systems, structure, construction, and materiality is central to the effective achievement of design intent. Students become aware of how these issues affect and inform design decisions. They learn to integrate technology, systems, and materials in the comprehensive resolution of building design and gain exposure to construction documents and design documentation. Construction and site visits are an integral part of the studio as is an integrated electronic media seminar on CAD applications. Students must coregister for ARCH 5380, Professional Practice 1, a concurrent 2-credit course that introduces codes, the regulatory process, agreements, contract documents, building design cost control, and administration. This course is required of all architecture students in the M.Arch. program.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6610 Graduate Architecture Design 3.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"Cross Listed: ARCH 4830 Integrated Design Development studio.\", \"credit_hours\": \"Credit Hours: 5\"}, {\"title\": \"ARCH 6630 - Graduate Architecture Design 5\", \"description\": \"This design studio will explore various concerns that relate architecture to environmental and ecological concerns. It will address human intervention at multiple and diverse scales within the natural world in order to understand their social, technical, aesthetic, conceptual, and philosophical implications for architectural design. Throughout the semester, the evolution of student design proposals will coordinate with the environmental and ecological issues that are presented in the supporting courses at CASE that are taken simultaneously with this studio. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6620.\", \"offered\": \"When Offered: Spring term anually.\", \"cross_listed\": \"Cross Listed: ARCH 4770.80, ARCH 4780.80.\", \"credit_hours\": \"Credit Hours: 5\"}, {\"title\": \"ARCH 6680 - History, Theory, Criticism 3\", \"description\": \"Works of architecture embody knowledge, ideas, and imagination that express formally, spatially, and materially the ways of living and values of the civilizations in which they occur. A select number of modern and contemporary buildings that represent a high degree of sophistication in the way their architects have approached the breadth of design issues both within and external to the programs of those works will be analyzed critically in order to ascertain the significance and relationships of the multiple systems of order inherent to a work of architecture. Reflecting on the knowledge and understandings acquired in all the previous courses in the history, theory, and criticism sequence, this course is a critical inquiry into the principal ideologies and premises of the most substantive architectural practices in the contemporary world. As such, the content of the course must necessarily evolve as the intellectual and cultural parameters of both theory and practice in the contemporary world change. This course is required of all architecture graduate students in the M.Arch. program.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 5110.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARCH 6750 - Final Project Design Research Seminar\", \"description\": \"This seminar is the first required course of the two-semester, 3rd-year Final Project course sequence in the M.Arch program and as such serves as a prerequisite to the spring semester Final Project Design Studio (ARCH 6XXX). The Design Research Seminar provides a forum for readings and discussions as well as design and/or material experimentation as it relates to the respective Graduate Final Project instructor\\u2019s thematic framework. The seminar also covers fundamentals related to standard methods of research and analysis. This course is required of all architecture graduate students in the M.Arch. program.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6680.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6810 - Research Design Seminar\", \"description\": \"The principal objective of this introductory seminar is to provide stude\\u00ad\\u00ad\\u00adnts with the opportunity to learn the fundamentals of research design. Research design includes: (1) identifying and selecting focused research problems/opportunities/ideas; (2) documenting the state of the art in the selected research area; (3) identifying the critical resources and settings to carry out the research; (4) designing the research program including strategies and tactics for carrying out the research. It is hoped that the knowledge gained in the RD Seminar will assist students in the development of their own individual thesis proposals while they contribute to active research. B.Arch. students can only register for the 4000 level of this course and M.Arch. students must register only for the 6000 level of this course.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6830 - Graduate Thesis Seminar: Acoustics\", \"description\": \"The Graduate Thesis Seminar: Acoustics is designed to provide support to graduate students who are engaged in independent thesis research projects. It is a required course for all graduate students in the Architectural Acoustics programs. This seminar provides a formal opportunity for students and faculty from a range of concentrations to meet together and discuss thesis work in progress.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6810.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARCH 6840 - Engineering Acoustics\", \"description\": \"Introductory materials of engineering acoustics for students with basic knowledge in mathematics (at least one level of first-year college). Much of the course material is taken from the textbook \\u201cAcoustics for Engineers\\u201d by Blauert and Xiang (2nd Ed.). The course includes mechanic and acoustic oscillations, the wave equations in fluids, governing equations for horns and ducts, spherical sound sources and arrays, piston membranes, diffraction and scattering, dissipation, reflection, refraction and absorption, isolation of air- and structure-borne sounds, noise propagation and noise control. B.S. and B.Arch. students can only reqister for the 4000 level of this course and M.S.Arch. Acoustics students must register only for the 6000 level of this course.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARCH 4890.\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6860 - Applied Psychoacoustics\", \"description\": \"This course covers the fundamentals of psychoacoustics with a focus on Architectural Acoustics. Topics include the functional overview of the auditory system, loudness, pitch, timbre perception, masking, binaural hearing, auditory scene analysis, multi-modal integration, and auditory perception in rooms. Required signal processing methods will be covered as well. The graduate-level course requires an extensive individual project and more advanced analysis.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6870 - Sonics Research Laboratory 1\", \"description\": \"The Sonics Research Lab is completely research based.  The first part (the fall semester) will be focused on hands-on research tools and techniques.  First, we will prepare basics of digital signal processing, develop an understanding of measurement equipment and analysis methods for sound. We will examine the ISO standards of room-acoustic measurements, develop our research goals and a specific set of data to gather for our research. We will also prepare the students with the fundamental knowledge on CATT Acoustic and/or EASE in geometrical modeling. Then the students and professors will visit a number of performance venues (e.g. EMPAC Concert Hall, and/ or other venues) and perform the room-acoustic measurements. Students will then work on analyzing and interpreting the research results.  Practice measurements will be scheduled in the gallery or somewhere on campus before trips to performance halls. MATLAB, playing a central role throughout the entire classes (SRL I & II), and the thesis research projects. It will be used during the class excises. Within one week from the semester start every student is required to INSTALL a functioning MATLAB Software package onto her/his laptop computer.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARCH 4870\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6880 - Sonics Research Laboratory 2\", \"description\": \"The second semester of the Sonics Research Lab includes advanced acoustical measurement techniques. Another important part of the semester curriculum concerns noise sources, noise control and vibration measurements. State-of-the-art, commercial software and school research-based software will be used for simulation/analysis/measurement of room acoustics in order to show the students how such technical tools assist in acoustics research and consulting practice for the design of performance and public spaces. The course will also give students a deeper theoretical understanding of architectural acoustics in order to assist them in room acoustics research. There will also be labs to reflect typical measurement procedures and (if time permits) site visits to acoustics research labs and different types of acoustical spaces. The Sonics Research Lab II emphasizes more training on independent hands-on and problem-solving skills (than the SRL I).\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6870/ARCH 4870 or instructor approval.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: ARCH 4810.\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6890 - Aural Architecture\", \"description\": \"In this course, design processes in architectural acoustics will be studied from a psychoacoustical perspective. Different concepts to create physical and virtual acoustic spaces will be discussed based on perceptual design goals. Topics include ecological psychoacoustics, sound quality, auditory virtual environments, and auditory computational modeling.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 6860.\", \"offered\": \"When Offered: Spring term anually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 6900 - Graduate Thesis Seminar\", \"description\": \"Readings and discussion of topical materials that are selected to place graduate projects and theses in a comprehensive context.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6910 - Doctoral Seminar 1\", \"description\": \"This seminar introduces a disciplinary-specific approach to the development of research problem definition and research methods. The topics considered will be drawn from and situated within the various fields of study that support doctoral study in architectural sciences, as well as from research activities in related fields in engineering, science, and the humanities. Case studies of prototypical architectural science research will evaluate current practice, identifying state of knowledge with the field and the resources and settings necessary to support the research activity.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6920 - Doctoral Seminar 2\", \"description\": \"This seminar builds upon Doctoral Seminar 1 by cultivating a disciplinary-specific approach to the development of research problem definition and research methods. The topics considered will be drawn from and situated within the various fields of study that support doctoral study in architectural sciences, as well as from research activities in related fields in engineering, science, and the humanities. Case studies of prototypical architectural science research will evaluate current practice, identifying state of knowledge with the field and the resources and settings necessary to support the research activity.\", \"prerequisites\": \"Prerequisites/Corequisites: ARCH 6910 Doctoral Seminar 1.\", \"offered\": \"When Offered: Spring and fall terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 6940 - Advanced Individual Projects in Architecture and Environmental Design\", \"description\": \"Individual projects and readings adapted to the needs of individual students at the advanced level.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1 to 6\"}, {\"title\": \"ARCH 6948 - Graduate Final Project\", \"description\": \"This design studio is the second required course of the two-semester, 3rd-year Graduate Final Project course sequence in the graduate M.Arch. program. The Graduate Final Project Design Studio provides a forum for the design and development of a comprehensive architectural proposal pertinent to the Final Project course sequence. This course is required of all third-year architecture graduate students in the M.Arch. program.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 6\"}, {\"title\": \"ARCH 6960 - Special Topics in Architecture and Environmental Design\", \"description\": \"Experimental courses tried out in one or two terms as the general program requires.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1 to 4\"}, {\"title\": \"ARCH 6970 - Professional Project\", \"description\": \"Active participation in a semester-long project, under the supervision of a faculty adviser. A Professional Project often serves as a culminating experience for a Professional Master\\u2019s program but, with departmental or school approval, can be used to fulfill other program requirements. With approval, students may register for more than one Professional Project. Professional Projects must result in documentation established by each department or school, but are not submitted to the Office of Graduate Education and are not archived in the library. Grades of A, B, C, or F are assigned by the faculty adviser at the end of the semester. If not completed on time, a formal Incomplete grade may be assigned by the faculty adviser, listing the work remaining to be completed and the time limit for completing this work.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"\"}, {\"title\": \"ARCH 6980 - Master\\u2019s Project\", \"description\": \"Active participation in a master\\u2019s-level project, under the supervision of a faculty adviser, leading to a master\\u2019s project report. Grades S or U are assigned at the end of the semester.  If recommended by the adviser, the master\\u2019s project may be accepted by the Office of Graduate Education to be archived in the library.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: ARCH 6630, ARCH 6750.\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1 to 9\"}, {\"title\": \"ARCH 6981 - Methods Seminar\", \"description\": \"Situated within the context of the Master\\u2019s Thesis (ARCH 6990) directed research studio sequence, this course addresses general methods of design research with an emphasis on studying the ways in which the discipline of architecture engages other fields of knowledge. Through a series of historical and contemporary writings as well as specific precedents in architectural design, students will look at how the discipline of architecture has absorbed external disciplinary, technological, and cultural influences as a means of advancing itself in the world.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARCH 6990 - Master\\u2019s Thesis\", \"description\": \"Active participation in research, under the supervision of a faculty adviser, leading to a master\\u2019s thesis. Grades of S or U are assigned by the adviser each term to reflect the student\\u2019s research progress for the given semester. Once the thesis has been presentend, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 5-6\"}, {\"title\": \"ARCH 9990 - Dissertation\", \"description\": \"Active participation in research, under the supervision of a faculty adviser, leading to a doctoral dissertation. Grades of IP are assigned until the dissertation has been publicly defended, approved by the doctoral committee, and accepted by the Office of Graduate Education to be archived in a standard format in the library. Grades will then be listed as S.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: Variable\"}, {\"title\": \"ARTS 1020 - Media Studio: Imaging\", \"description\": \"This course introduces students to digital photography, Web design, and interactive multimedia in making art. Students broaden their understanding of such topics as composition, effective use of images, color theory, typography, and narrative flow. Inquiry and experimentation are encouraged, leading towards the development of the skill and techniques needed to create visual art with electronic media.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 1030 - Digital Filmmaking\", \"description\": \"This is a hands-on introduction to film making. Students study a selection of great films; and learn how to make movies using lightweight field production equipment. Throughout the course students produce a variety of short videos in different genres, and develop their critical capacity for analyzing cinema and other forms of motion picutre storytelling. The class ends with a mini film festival where everyone presents their work.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 1040 - Art for Interactive Media\", \"description\": \"This course combines an introduction to traditional visual arts and digital media and serves as a foundation for work in game design and interactive art. Using studio projects that incorporate physical media, digital imaging and computer code, students develop their formal vocabulary, observational skills, and their understanding of issues in visual and interactive arts.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"Cross Listed: GSAS 1040.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 1050 - Art History: Paleolithic to Contemporary\", \"description\": \"A survey of visual arts from Paleolithic Era to today. Materials are presented in a form accessible to students without previous knowledge of Art History. This is a communication-intensive course.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 1200 - Basic Drawing\", \"description\": \"An introductory course in drawing designed to develop seeing ability and means of expressing visual ideas through graphic skills. The course consists of exercises in drawing from observation and studies from the history of art.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 1380 - Fundamentals of Music and Sound\", \"description\": \"This course is a hands-on introduction to the primary building blocks of music and musicianship in a 21st Century context. The course will explore acoustics and psychoacoustics, rhythm, pitch, harmony, melody, timbre, improvisation, composition, and music notation through engaged listening practices and creative projects. No formal musical background is expected.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annualy.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2010 - Intermediate Video\", \"description\": \"Intermediate Video is a hands-on intensive course that teaches the language, aesthetics, and techniques of video production. Working in groups and individually, students will develop and produce several short video projects. Emphasis will be on the acquisiton of creative and technical production skills in visualizing, scripting, aesthetics, shooting, sound design, and editing.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1030 or permission of instructor.\", \"offered\": \"When Offered: Fall term even-numbered years.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2020 - Music and Technology I\", \"description\": \"Music composition taught in the context of modern computerized production methods. Technical topics include basic principles of computer sound generation, digital sound sampling, and the use of small computers for musical control of electronic instruments. Musical topics include a study of important musical works and compositional techniques of the 20th century. Student projects involve hands-on work on a variety of computer instruments and software. This course is a prerequisite for further creative work with Rensselaer\\u2019s computer music facilities.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1010 or permission of instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2040 - Intermediate Digital Imaging\", \"description\": \"Intermediate Digital Imaging is a hands-on studio course exploring the use of computer technologies in making visual art. A study of contemporary issues in digital media and photography facilitates individual innovation and experimentation. Digital imaging and input/output techniques are employed in terms of giving visual form to ideas and personal expression in private and public settings.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1020 or permission of instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2060 - 2D Experimental Animation\", \"description\": \"2D Experimental Animation is an introduction to animation as an art form. Most of this course will be traditional assignments designed to encourage spontaneous creativity, explore animation concepts, and learn animation terminology. Assignments will build a solid foundation for entrance into Animation 1. This course will also be a historical and theoretical investigation with screenings and readings followed with discussion.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: ARTS 1020, ARTS 1200 or ARTS 1040.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2070 - Graphic Storytelling\", \"description\": \"A studio arts course exploring the fundamental concepts, techniques, styles, and mechanics used in the creation of graphic narrative. Contents to be covered include the fundamentals of sequential art, the purposes and formats of storyboards, basic terminology and concepts used in storyboarding, and the applications of storyboard techniques. Key visual storytelling structures are explored for the following industry applications: comics, animated films, graphic novels, commercials, documentaries, live action feature films, and video gaming.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1020 or ARTS 1200 or permission of instructor.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2080 - Contemporary Improvisation Ensemble\", \"description\": \"This ensemble explores a variety of contemporary non-idiomatic group improvisational practices. Non-idiomatic improvisation is spontaneous music that does not attempt to replicate or realize a particular historical style (such as swing or bebop jazz), but rather emphasizes the unique creative input of the performers to create original music. Among the techniques explored will be conduction, musical games, graphic and text scores, and cell-structure improvisation. Students will also be coached in techniques to expand and develop musical ideas individually and as a framework for group improvisation. No prior experience with improvisation is required, and participants from any musical background, including electronic and computer music, are encouraged to join. Repertoire and practices will be tailored to the make-up of the group.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2200 - Intermediate Drawing\", \"description\": \"Intermediate Drawing focuses on the exploration of the possibilities of visual translation using a variety of media and techniques.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 1200.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2210 - Sculpture I\", \"description\": \"A beginning sculpture course combining hands-on studio work sessions with lectures on the history and theory of sculpture practice. The studio component involves explorations of materials and techniques as tools for the enhancing of visual sensitivity and creative expression.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2220 - Fundamentals of 2-D Design\", \"description\": \"An introductory course which will present basic concepts about composition, line, pictorial space, light, and color in the visual arts in order to help students develop the means for expressing visual ideas effectively. Weekly homework design projects, using both traditional and electronic media, will be complemented by in-class slide lectures, video tapes, and critiques.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2230 - 3D Bootcamp\", \"description\": \"A foundational course in concepts and techniques in digital 3D, for animation, games, and digital art. This course focuses on methods and aesthetics in creating digital 3D objects, spaces, and characters, including modeling, texturing, and lighting, as preparation for further courses in the 3D Animation curriculum.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2300 - Rensselaer Orchestra\", \"description\": \"Readings, rehearsals, and performances of works from the standard repertoire for orchestra from the Baroque through the 20th century.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: demonstration of adequate skill in playing an orchestral instrument through audition.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARTS 2310 - Rensselaer Concert Choir\", \"description\": \"Readings, rehearsals, and performances of works from the standard choral repertoire, from the Renaissance through the 20th century. Attendance is mandatory and preparation expected.\", \"prerequisites\": \"Prerequisites/Corequisites: Audition with instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARTS 2340 - Introduction to Afro-Cuban Percussion\", \"description\": \"This course is an introduction to Afro-Cuban folkloric music traditions through lecture demonstration and class participation. The emphasis is on learning to play Afro-Cuban rhythms and percussion instruments (clave, conga, cowbell, shekere).\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2350 - Chamber Music Ensemble\", \"description\": \"An instrumental class that will be coached and rehearsed and will perform regularly. The larger ensemble will break up into smaller ensembles such as string quartets, woodwind quintets, trios, etc., depending on the make-up of the group, as well as into more unusual combinations that might be required to prepare 20th century repertoire. For intermediate and advanced players, entrance into the course is by authorization form/permission of instructor.\", \"prerequisites\": \"Prerequisites/Corequisites: Audition with instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARTS 2360 - Roots of Africa Music Ensemble\", \"description\": \"Roots of Africa Ensemble is a course devoted to learning and performing in African, Afro-Cuban, and New World Percussion.  Students will learn to play current music performed by the ensemble, a percussion ensemble engaged in workshop study and public performance of folkloric music, orginial works by various composers, including compositions by Dr. Eddie Ade Knowles. Under his direction, students will learn significance of performance within folklore ensembles and how to play instruments from Africa, Cuba, and the New World.\", \"prerequisites\": \"Prerequisites/Corequisites: Successful completeion of ARTS 2340, audition, and/or invitation by Professor Knowles.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARTS 2380 - Music and Sound I\", \"description\": \"This is the first course in a two-course sequence in music theory and aural skills. The course covers the fundamentals of diatonic harmony and two-part species counterpoint. Aural skills include interval, scale and chord identification, rhythmic and tonal solfege, and dictation. Learning activities include weekly assignments in analysis, composition, performance, improvisation, and self-paced use of software in the acquisition of aural skills.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 1380 or demonstrable proficiency in music.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2500 - History of Western Music\", \"description\": \"The objective of this course is for students to be able to recognize and appreciate the stylistic elements of the major periods and composers from the earliest known music to the present. The influences on music by broad cultural and historical forces will also be explored. Beginning with the Greeks, the course will progress chronologically from the polyphonic religious music of the Middle Ages through the Renaissance, Baroque, Classical, Romantic, and modern periods.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2520 - World Music\", \"description\": \"From \\u201craves\\u201d to symphony hall, Indian film music to Tibetan chant, monster truck rallies to a mother\\u2019s lullaby, musical soundscapes surround us through all aspects of our daily lives. This course focuses on the study of music in or as culture. The exploration of music in human life will be comparative, using case studies from diverse world traditions and examining topics such as: ritual, media and technology, ethnicity/identity, music and dance, and musical transmission.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term even-numbered years.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2540 - The Multimedia Century\", \"description\": \"This course will survey the history and theory of the diverse artistic practices of the twentieth century in relation to the development of the mass media and new technologies. Topics will include the Bauhaus, Surrealism, Pop Art, and Postmodernism and will span a spectrum of media from the more traditional, such as painting and photography, to electronic and new media, such as video and digital arts. This is a communication-intensive course.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 2600 - Ensemble Nonlinear\", \"description\": \"A technology-based performance ensemble, as well as a practice-based studio course, focused on the composition, design, and programming of new musical works and instruments. Students create and perform electronic music using laptops, microprocessors, \\u2018digital networks and a range of new interfaces for musical expression. ARTS 4600/6600 combines studio and ensemble.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: ARTS 4600, ARTS 6600\", \"credit_hours\": \"Credit Hours: 1\"}, {\"title\": \"ARTS 2940 - Studies in the Arts\", \"description\": \"Individual and collaborative projects and assignments at the 2000 level adapted to the needs of individual students.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Variable.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 1 to 6\"}, {\"title\": \"ARTS 2960 - Topics in the Arts\", \"description\": \"Experimental courses offered for one or two semesters.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Variable.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2 to 4\"}, {\"title\": \"ARTS 4010 - Interactive Arts Programming\", \"description\": \"IAP will examine theoretical concepts of interactive media as well as develop the practical skills needed to implement these concepts using the facilities of the iEAR studios. Topics include high and low level computer programming and electronics. Students will build installations and projects, which control live performance interactions with graphics, video, and sound.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: ARTS 2010 or ARTS 2020 or permission of the instructor.\", \"offered\": \"When Offered: Fall and spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4020 - Advanced Digital 3-D Projects\", \"description\": \"This studio/seminar consists of longer projects with attention to concept, process, and finish. The student will either work individually or as a member on a team and be expected to have a vision or concept they are driven to create. Some possible topics covered may include virtual environments, advanced shader networks, MEL, compositing, non photorealistic rendering, 3-D graphics programming, game engines, or motion capture.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: ARTS 4070 or permission of instructor.\", \"offered\": \"When Offered: Upon availability.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4030 - Multimedia Performance Systems\", \"description\": \"Multimedia Performance Systems explores the composition and programming of real-time performance systems. The course will examine the basics of MIDI, sound synthesis, digital signal processing, and image/video manipulation. Final projects will consist of a real-time performance system or interactive installation.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite:  ARTS 2020, graduate status, or permission of instructor. This course is a good introduction for ARTS 4010, ARTS 4510, and special project seminars in the Electronic Arts.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6030. Students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4040 - Rethinking Documentary: Video Production\", \"description\": \"This is a production course investigating non-traditional approaches to documentary or non-fiction film/video. Taking a broad look at what defines \\u201cdocumentary\\u201d media, this course will incorporate criticism with production. Students will produce a range of video works questioning conventional documentary styles, using radical and interventionist techniques. Students will study traditional documentary works including ethnographic films, cinema verit\\u00e9, propaganda films, \\u201chome movies,\\u201d reality TV, tabloid news, autobiographic and activist videos.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1030 or permission of instructor.\", \"offered\": \"When Offered: Fall term even-numbered years.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4060 - 3D Visual Effects\", \"description\": \"An introduction to the technical techniques and principles of computer animation with a focus on rigging, skinning, character fx, particle simulations, compositioning and rendering. Lectures, discussion, and exposure to contemporary work enable students to develop skills in this rapidly evolving field.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 2230 3D Bootcamp or permission of instructor.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4070 - 3D Animation\", \"description\": \"An intermediate hands-on studio course in 3-D computer animation, acting, dialog, cinematography, and story building.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 2230 3D Bootcamp, ARTS 4060 or permission of instructor.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4080 - Art, Community, and Technology\", \"description\": \"Through direct experience in the community, this course explores the complex roles and relationships of art, education, and technology. Students will develop a plan to work with a media arts center, community organization, or school; final teams will produce real-world arts and education projects that ultimately will be realized as significant additions to their professional portfolio. The projects can include a range from traditional arts practice to creative writing, creative IT models, to community art and activism.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring and fall terms annually.\", \"cross_listed\": \"Cross Listed: ARTS 6250. Students cannot receive credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4090 - Art and Code and Interactivity\", \"description\": \"This course is primarily concerned with learning how to build any interactive experience or artwork from concept to completion. It will introduce open-source, cross-platform programming libraries and tools used by artists and programmers to create interactive experiences and artworks for museum installations, festivals, VJ-ing, projection mapping, interactive experiences/artworks, and more. Then, we start to address the questions: Is code an art form? What is interactive art? Is software art?\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1020 or permission of instructor.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6090; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4100 - Electronic Arts Theory Seminar\", \"description\": \"This course will be devoted to the investigation of diverse topics of electronic arts history, theory, and practice.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: 2000-level ARTS course or permission of instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4130 - New Media Theory\", \"description\": \"This course asks what is really new about New Media, and looks at creative practices, theoretical discourses, and social contexts to find answers. The course concentrates on cutting edge cultural expression using information and communication technologies. The objective to equip students with multiple perspectives - aesthetic, communications, historical - with which to analyze, critique, and develop original concepts about the uses of new media in art and culture. This is a communication-intensive course.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites:  ARTS 2500, ARTS 2540, or a 2000-level history-theory course in Audio Culture.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6130; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4150 - Media Watch\", \"description\": \"This seminar is an investigation of the successes and failures of the news media, set within historical and contemporary contexts. The title \\u201cmedia watch\\u201d is intended to evoke a watch-dog approach found in independent media sources and organizations like human rights watch. Assignments involve analyzing how issues are portrayed in the media, and students choose their topics according to their interests. The course can therefore enhance capstone, thesis, or dissertation work.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites:  2000-level art, media, or cultural history course, or permission of instructor.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6150. Student cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4160 - Music and Technology II\", \"description\": \"This course assumes knowledge and experience in computer music applications and performance. It is directed to undergraduate students as an upper-level seminar guiding their progress through the composition of a significant musical work. The class is divided between a group seminar, focusing on aesthetic, theoretical, and technical issues, and a workshop/lab in performance, computer applications and composition.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 2020 or permission of instructor.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6160; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4200 - Advanced Drawing\", \"description\": \"Advanced Drawing is designed to help students who have mastered basic drawing skills to enhance those skills and utilize them to explore visual ideas. Emphasis is placed on individual development of skills and subject matter to help students express themselves visually. Examples and studies are used from master drawings of the past to learn about the history of art and to stimulate ideas for the students\\u2019 own work.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1200, or permission of instructor.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6200; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4210 - Sculpture II\", \"description\": \"An advanced studio course in sculpture for students who have taken Sculpture I. Students are encouraged to explore personal areas of interest and are required to develop a familiarity with the history of sculpture as well as mastering fabrication techniques.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 2210.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4220 - Painting\", \"description\": \"A painting course in opaque media such as oil or acrylic with emphasis on color interaction, composition, and pictorial design. Using sources from observation and the history of painting, students are taught to see and convey effects of color on/in 2-D pictorial space and to develop critical skills in looking at paintings.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1200.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6220; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4230 - Inflatable Sculpture\", \"description\": \"This class studies, creates, and publicly presents inflatable sculptures. The history of inflatables are examined, with special attention paid to how they have been used in political movements that imagine utopian social futures, and how those applications contrast with commercial uses (such as advertising) that have become commonplace in public spaces today. Throughout the class will explore, design, and build inflated structures that may include video and sound elements.\", \"prerequisites\": \"Prerequisites/Corequisites: Junior or senior standing or permission of instructor.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: ARTS 6230 Inflatable Sculpture.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4240 - Eco Chic: Living Art\", \"description\": \"Eco Chic: Living Art is an upper level production and theory class about art, biology, and the study of life covering topics such as environmentalism, land art, food art, sustainable practices with art, body art, bio-art. Part lecture, part hands-on workshop, Eco Chic encourages students to redefine and experimentally express their relationships with the varied aspects of everyday living systems and manipulating life.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 1200 or permission of instructor.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6240 and may not be taken for credit twice under different numbers.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4260 - Life Drawing and Anatomy for Artists\", \"description\": \"Life Drawing and Anatomy for Artists is an advanced drawing class that will focus on drawing the human figure. Students will work from live models to refine their drawing skills; clay models from anatomical texts will be made to develop a working knowledge of anatomy for artists. Gesture, proportion, and expression of the human figure will be emphasized; general concepts of design and composition will also be presented.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1200.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6260; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4380 - Music and Sound II\", \"description\": \"A continuation of studies in harmony, analysis, and ear-training. With an introduction to orchestration and 20th century techniques, the course will culminate with an original composition.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 2380.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4390 - Composition Seminar\", \"description\": \"This course is a mixed media skills-based and creative project seminar that merges the skills acquired in Music and Sound 1 & 2 and Music and Tech 1 & 2. Students will survey methods of creating advanced music/sound compositions that employ acoustic and/or electronic sound production techniques and approaches to transmitting these ideas to interpreters through scores. Through a series of sonic experiments and composition projects, students investigate sound as a medium for artistic expression, focusing on fundamental concepts of unity, contrast, and form as methods of organizing musical works and performances, both fixed and improvised. Analysis and exercises will culminate in a final composition that will be performed, in concert/installation, by a professional, hired ensemble at the end of the semester.\", \"prerequisites\": \"Prerequisites/Corequisites: Both ARTS 4380 and ARTS 4160 or permission of instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4410 - Deep Listening\", \"description\": \"Deep Listening is a practice created by the instructor to enhance and expand listening abilities and to encourage creative work. The class will explore different forms of listening including field recording. Each class time will involve experiential exercises, sound pieces, readings, and discussion. Musical training is not prerequisite.\", \"prerequisites\": \"Prerequisites/Corequisites: Permission of instructor.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6410; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4420 - Experimental Telepresence\", \"description\": \"Experiemental Telepresence: investigates the INTERNET as an experimental venue for audio and video performance through improvisation and composition. Students will learn protocols for telepresence connections, connect with other institutions using a variety of media in local and co-located performances. The seminar multimedia ensemble Tintinnabulate will be used as a resource of projects.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4430 - Topics in Deep Listening\", \"description\": \"This course continues the practice and study of Deep Listening beyond the foundational course \\u201cDeep Listening.\\u201d Topics include a wide range of investigations, research, and creativity in Deep Listening.\", \"prerequisites\": \"Prerequisites/Corequisites: Vary with topic. Permission of instructor.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: ARTS 6430 Topics in Deep Listening.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4460 - Animation Production\", \"description\": \"Animation Production is designed to give an animation industry experience by completing the entire process of creating an animated short. Learning long-term time management and finding the key time cost/benefits will be essential to success. The course schedule is setup to replicate the industry model of frequent updates and feedback \\u2013 dailies.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 4060 or ARTS 4070.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4510 - Experimental Game Design\", \"description\": \"Experimental Game Design is an upper level studio arts course focusing on the creation of innovative, workable game prototypes using a variety of interactive multimedia. Games are considered as a new genre and are analyzed as cultural artifacts. The aesthetics of game design including character development, level design, game play experience, and delivery systems are covered. Flow, game theory, and game play gestalt are considered. Alternate gaming paradigms and emerging forms are encouraged.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 1020 or permission of instructor.\", \"offered\": \"\", \"cross_listed\": \"Cross Listed: GSAS 4510.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4560 - Hactivism\", \"description\": \"This course explores the history, methods, and goals of hackers with special attention paid to their role in social movements. It broadly interprets the term \\u201chacktivism\\u201d to include computer hacking, media hacking and \\u201creality hacking\\u201d in the service of social change. Students will gain an understanding of how and why hackers have emerged as a major social force.\", \"prerequisites\": \"Prerequisites/Corequisites: Junior or senior standing, or permission of instructor.\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: ARTS 6560 Hactivism.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4600 - Ensemble Nonlinear\", \"description\": \"A technology-based performance ensemble, as well as a practice-based studio course, focused on the composition, design, and programming of new musical works and instruments. Students create and perform electronic music using laptops, microprocessors, \\u2018digital networks and a range of new interfaces for musical expression. ARTS 4600/6600 combines studio and ensemble.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: ARTS 2600 and ARTS 6600\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4620 - Exploring Movement and Sound\", \"description\": \"The exploration of movement often reveals sensitivities concerning the body, identity, gesture, culture, sensory awareness, perception, space, orientation, kinesthesia, time, relationships to people and objects, as well as cultural notions of embodiment and the senses. This course employs practice-based work, creative experimentation, and traditional forms of research (reading, viewing media, writing, discussions) as the primary methods to illuminate the issues concerning enactive (movement) knowledge. This is a Deep Listening-related course.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARTS 6962.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4630 - Writing and Directing for Video\", \"description\": \"The course introduces students to the art of writing and directing short videos, with an emphasis on generating ideas, and realizing them in a well-developed final project. Major theories and principles are studied through a comparative analysis of scripts and films. Students learn to work with actors, write their own scripts, and direct videos. Two final projects \\u2013 a script and a video \\u2013 will integrate all of the elements covered in class. Lecture/Practicum.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: ARTS 1030 or permission of instructor.\", \"offered\": \"When Offered: Upon availability.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4640 - Science Fictions\", \"description\": \"Science Fictions is an advanced narrative video production and theory course. The class looks at thematic areas of science fiction, utopia and dystopia, paranormal, and speculative fiction. \\u2018Speculative fiction\\u2019 is a genre that looks at the real world and extends what is known about it, building on the \\u2018real.\\u2019 The class has two threads: to study narrative structure and create a series of sci-fi videos; to discuss and analyze mainstream and avant-garde science fiction films and themes from the early 1900s to the present.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARTS 1030 or permission of instructor.\", \"offered\": \"When Offered: Fall term odd-numbered years.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6640; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4840 - Creative Seminar I\", \"description\": \"This course is for senior EMAC and EART majors and is the core creative forum for the development and presentation of the senior thesis. The course is the first part of a two-semester study provided in two seminar courses. The focus of the course is to develop a proposal for for a written thesis and a creative project that students will execute in the second seminar and exhibit in an exhibition.\", \"prerequisites\": \"Prerequisites/Corequisites: Senior EMAC and EART majors only.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4850 - Creative Seminar II\", \"description\": \"This course is for senior EMAC and EART majors. The goal of the Creative Seminar II is to develop and formulate ideas from Creative Seminar I into a unique project for the artists/communicator that will demonstrate his/her independent ideas, research, writing, and design skills. Students will develop a written thesis, creative project (e.g., art, graphic design, interaction design, music, performance), prepare and present their project in a public exhibition, and design the publicity for the show.\", \"prerequisites\": \"Prerequisites/Corequisites: Creative Seminar I, senior EMAC and EART majors only.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4860 - Advanced Digital Imaging\", \"description\": \"This upper level studio and seminar explores individual visual arts projects contributing to thesis or dissertation development. Topics in creative personal expression in imaging, installation, digital/traditional mixed media and emerging genres will be studied drawing from issues raised in class projects. Advanced studies may include high resolution digital photography, montage, archival printing, gesture drawing, painting, assemblage, processing, stencil art, projection, and evolving genres which lead to an independent final project and web portfolio.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: one related 2000-level arts course or permission of instructor.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 6860; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4870 - Creative Data Design\", \"description\": \"Data design offers a way to reveal, analyze, and engage with data, from scientific visualization to information design to artistic sonification. At the same time, the translation from abstract data to image and sound carries risks of manipulation and subjective interpretation. This course introduces contemporary practices in the perceptualizing of data using digital tools for creative exploration and critical analysis. It explores the evolution of visualization and the notion of truth through visual representation.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 1020 OR COMM 2610 and CSCI 1100.\", \"offered\": \"When Offered: Spring term even-numbered. years\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4880 - Interdisciplinary Research Seminar\", \"description\": \"This is a course introducing music majors to advanced research topics of the Rensselaer music faculty.  Each semester a member of the music faculty will focus the seminar on a research topic or paradigm related to their own body of artistic and technological research. Sample topics might include Spatial music and sound, New Instrument Design, Network Music, Music Information Retrieval, Ethnomusicology, Sonification Art and Science, Music and Logic, Spectralism and Beyond, Music Herstory (feminist music composition), Experimental music and sound history. Through hands-on creative research, students will explore questions of both musical and technological significance while engaging that same topic through their own hands-on creative practice.\", \"prerequisites\": \"Prerequisites/Corequisites: ARTS 4380 and ARTS 4160 or permission of instructor.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 4940 - Studies in the Arts\", \"description\": \"Individual and collaborative projects and assignments at the 4000 level adapted to the needs of indivudal students.\", \"prerequisites\": \"Prerequisites/Corequisites: Variable.\", \"offered\": \"\", \"cross_listed\": \"Cross Listed: Variable.\", \"credit_hours\": \"Credit Hours: 1 to 6\"}, {\"title\": \"ARTS 4960 - Topics in the Arts\", \"description\": \"Experimental courses offered for one or two semesters.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2 to 4\"}, {\"title\": \"ARTS 4990 - B.S. EARTS Thesis\", \"description\": \"The purpose of this course is to demonstrate the student\\u2019s capacity for independent work integrating concepts and media from the full range of their studio, history, and theory studies. It is a project-based class, cluminating in a written thesis paper and a public presentation of work determined by the student. This course may be taken multiple times, but is a requirement in the student\\u2019s final two semesters.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: junior and senior EART majors only.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 6030 - Multimedia Performance Systems\", \"description\": \"Multimedia Performance Systems explores the composition and programming of real-time performance systems. The course will examine the basics of MIDI, sound synthesis, digital signal processing, and image/video manipulation. Final projects will consist of a real-time performance system or interactive installation.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 4030. Students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 6050 - Rethinking Documentary: Video Production\", \"description\": \"Rethinking Documentary is a graduate level production course in film and video. Taking a broad look at what defines \\u201cdocumentary\\u201d media, this course incorporates criticism with production to examine key issues in the discipline, such as truth versus fiction, personal responsibility, community involvement, the efficacy of video intervention and the authority of mass media. Students are required to produce a range of video works questioning conventional documentary styles, using radical and interventionist techniques to tell compelling or poetic stories.\", \"prerequisites\": \"Prerequisites/Corequisites: Must be a graduate student.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 6080 - Graduate Studio Critique\", \"description\": \"Development and completion of individual creative projects with a focus on studio production, method, and process. Students are expected to foster an environment in which serious and sophisticated peer critique can take place.\", \"prerequisites\": \"Prerequisites/Corequisites: Graduate standing.\", \"offered\": \"When Offered: Fall and spring terms annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3, repeatable with no maximum.\"}, {\"title\": \"ARTS 6090 - Art and Code and Interactivity\", \"description\": \"This course is primarily concerned with learning how to build any interactive experience or artwork from concept to completion. It will introduce open-source, cross-platform programming libraries and tools used by artists and programmers to create interactive experiences and artworks for museum installations, festivals, VJ-ing, projection mapping, interactive experiences/artworks, and more. Then, the course starts to address the questions: Is code an art form? What is interactive art? Is software art?\", \"prerequisites\": \"\", \"offered\": \"When Offered: Upon availability of instructor.\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 4090; students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}, {\"title\": \"ARTS 6110 - Electronic Arts Overview\", \"description\": \"This seminar will provide a historical context for understanding and analyzing practices and theories of contemporary electronic art. The curriculum is a mix of field surveys, readings of primary sources in aesthetic, media and critical theory, and examination of contemporary topics and controversies. The seminar is also intended to support the development and articulation of the student\\u2019s creative practice. Open to graduate students across the Institute.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: limited students of graduate standing.\", \"offered\": \"When Offered: Annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARTS 6120 - Fieldwork as Art\", \"description\": \"This course is an introduction to fieldwork and ethnographic methods in support of artistic creation. The class will guide students through interviews, participant-observation, and documentation at various field sites to produce diverse creative projects ranging from ethnographic essays to video to installations. Students will be encouraged to work on topical materials of their choice, focused on issues such as technological change, artistic subcultures, or environmentalism. Enrollment is restricted to students with graduate standing or by permission of the instructor.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARTS 6130 - New Media Theory\", \"description\": \"This course asks what is really new about New Media, and looks at creative practices, theoretical discourses, and social contexts to find answers. The course concentrates on cutting edge cultural expression using information and communication technologies. The objective is to equip students with multiple perspectives \\u2014 aesthetic, communications, historical \\u2014 with which to analyze, critique, and develop original concepts about the uses of new media in art and culture.\", \"prerequisites\": \"\", \"offered\": \"\", \"cross_listed\": \"Cross Listed: Cross listed with ARTS 4130. Students cannot obtain credit for both courses.\", \"credit_hours\": \"Credit Hours: 4\"}]"