"[{\"title\": \"ARCH 6390 - Energy and Systems Simulation\", \"description\": \"Energy and Systems Simulation provides students with an introduction to advanced simulation tools and procedures necessary for analyzing the performance of complex environmental building systems. The course utilizes parametric software for the simulation and analysis of multi-objective optimization workflow procedures. Areas of building performance assessment include thermal and daylight optimization.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 1200 - Beginners Architecture Career Discovery Program\", \"description\": \"Two-week introduction to architecture for rising high school juniors and seniors includes morning programs and introductory lectures in history and theory of architecture, computing and simulation, freehand and extreme drawing, building ecologies, building conservation, and construction systems. There will be field trips and career counseling. Afternoons will have individually critiqueed (tutored) design studios, group and individual projects, reviews, and public presentation. Acts as an opportunity for career discovery to decide whether a design education in architecture is appropriate. Summer term annually. Dates TBA. 9:00 - 4:00 pm.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Summer term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"\"}, {\"title\": \"ARCH 6400 - Criticism I\", \"description\": \"Criticism I introduces students to both historical and contemporary forms of discourse as it relates to the disciplines of architecture, landscape architecture, and urbanism. The course serves as an introduction to critical thinking and writing and provides students with the necessary analytical, verbal, and written skill sets to effectively participate in the discursive aspects of the disciplines of architecture, landscape architecture, and urbanism.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 1210 - Advanced Architecture Career Discovery Program\", \"description\": \"Similar structure as the Beginners program. The Advanced program will continue to cultivate design foundations explored in the Beginners course. Dates: TBA. 9:00 - 4:00 pm.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 1200.\", \"offered\": \"When Offered: Summer term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"\"}, {\"title\": \"ARCH 2150 - The Ethos of Architecture\", \"description\": \"This course will examine the spectrum of architectural phenomena and ideas without a specific chronology using examples ranging from antiquity to the contemporary world in western and non-western civilizations and produced in both vernacular and disciplinary cultures. An essential part of this course is to stimulate students\\u2019 curiosity about architecture and the larger world and introduce them to key issues of architecture regarding space, form, critique, technology, aesthetics, societal and cultural contexts, etc. Particular emphasis will be given to the emergence of modernism in architecture. Crucial to the goals of this course is to encourage students to pursue and develop their own unique vision and voice in architecture throughout their education and practice. Fundamental to this process is making students aware of the necessity to challenge their own subjectivities, biases, and presuppositions.\", \"prerequisites\": \"\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 2160 - Architectural Media\", \"description\": \"This course continues the inquiry begun in ARCH 2150 The Ethos of Architecture and focuses especially on the implications that various media and means of representation have on the breadth of concerns within the history, theory, and critical practices of architecture and especially the generation of architecture.\", \"prerequisites\": \"Prerequisites/Corequisites: ARCH 4090 Architectural Case Studies.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 2330 - Structures 1\", \"description\": \"Introduction to Structures introduces the student of Architecture to the principles of structural mechanics and their application to basic architectural structures comprised primarily of wood. The fundamentals of statics are presented in order to gain an understanding of the way in which external forces produce internal stresses in individual members and, in essence, flow through the building system to be resolved at the foundation level. The principles of strength of materials are studied to understand how particular structural materials and configurations manage to resist these forces without unacceptable distortions, or even failure. Wood structural properties are studied in all their complexity as a means to internalize the more theoretical topics broached. Through in-class presentations, reading, homework and project work, computer lab, field trips, and case studies, the student will be aided in developing this intuitive (while practical) understanding. It is recognized that intuitions of building technologies are not acquired quickly but result from much study, observation, and practice. Introduction to Structures makes use of the several approaches above to ensure that the beginning student is provided with a broad, solid base for future structural investigations. WebCT will be used to expand the student\\u2019s access to course materials and allow for a measure of distance learning. Sustainability: The following notions are introduced as important attributes of sustainable structures and construction: durability and service life and life cycle cost.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 2510 except M.Arch. students.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARCH 5140 Structures 1.\", \"credit_hours\": \"Credit Hours: 3\"}, {\"title\": \"ARCH 2350 - Construction Systems\", \"description\": \"Construction Systems centers on the development of a technical knowledge of, sensibility to, and intuition for the process by which an architectural design is realized in built form. The interdependence among building materials, acoustic qualities, enclosure systems, interior, finish, and other systems is investigated, with an emphasis on the broader architectural design endeavor. Drawing as a means of understanding forms the basis for a semester-long project to be done in small groups. Case studies will center on concepts and systems that have not yet found their way into mainstream practice. The course approach will involve in-class presentations, project work, field trips, and case studies. WebCT will be used to expand the student\\u2019s access to course materials and allow for a measure of distance learning. Sustainability: The notion that design intentions can be nullified through incorrect construction is stressed. The importance of proper detailing, construction, and maintenance to accomplish lasting and efficient enclosures is highlighted. Skills to diagnose and treat incorrect construction are developed.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisite: ARCH 2510 except M.Arch. students.\", \"offered\": \"When Offered: Fall term annually.\", \"cross_listed\": \"Cross Listed: ARCH 5300 Materials and Construction Systems.\", \"credit_hours\": \"Credit Hours: 2\"}, {\"title\": \"ARCH 2360 - Environmental and Ecological Systems\", \"description\": \"An exploration of the fundamental principles of human physiology, thermal and luminous comfort, and indoor quality. Emphasis is on bioclimatic and psychrometric climate analysis and its relationship to architectural design, understanding the energy exchange between body in space, the natural meaning of enclosures, and nonstructural materials and systems. The focus is on passive heating, cooling, and daylighting systems and their design. Exercises include vital sign analysis of existing spaces (thermal, air, luminous), forming hypotheses of building performance, using scientific instrumentation, tenant survey techniques, and physical modeling and simulation techniques related to daylighting and shading techniques.\", \"prerequisites\": \"Prerequisites/Corequisites: Prerequisites: PHYS 1500, ARCH 2820, or permission of instructor.\", \"offered\": \"When Offered: Spring term annually.\", \"cross_listed\": \"Cross Listed: ARCH 5310 Environment and Ecological Systems.\", \"credit_hours\": \"Credit Hours: 4\"}]"